app/Controllers/Tweet.php

SELECT *
FROM `users`
WHERE `users`.`id` = '1'
---
    public function __construct()
    {
        $this->categories = (new \Config\AdtConfig())->getCategories();
        $this->sess = session();
        $this->curUser = $this->sess->get('currentuser');

        $this->tweetMdl = new TweetModel();
        $userMdl = new \App\Models\UserModel();
        $this->profile = $userMdl->find($this->curUser['userid']);

SELECT *
FROM `tweets`
WHERE `tweets`.`id` = '8'
UPDATE `tweets` SET `like` = 0
WHERE `tweets`.`id` IN ('8')
---
    public function like($tweet_id)
    {
        // Check if the form is submitted and the like button is clicked
        if ($this->request->getMethod() === 'post' && $this->request->getPost('like') !== null) {
            $tweet = $this->tweetMdl->find($tweet_id);

            if ($tweet) {
                $like = !$tweet->like; // Toggle the like status
                $updated = $this->tweetMdl->update($tweet_id, ['like' => $like]);