app/Models/TweetModel.php

INSERT INTO `tweets` (`user_id`, `content`, `category`, `uphoto`) VALUES (3, 'ngetes aja lah', 'pendidikan', 'asset/uploads/1689318119_138a7836ca88efb6f657.png')
---
    public function newTweet($curUser, $post)
    {
        $tweet = new Tweet();
        $tweet->user_id = $curUser['userid'];
        $tweet->content = $post['content'];
        $tweet->category = $post['category'];
        $tweet->uphoto = $post['uphoto'];
        $this->save($tweet);

SELECT `tweets`.`id`, `user_id`, `username`, `fullname`, `content`, `category`, `created_at`, `uphoto`, `tweets`.`like`
FROM `tweets`
JOIN `users` ON `users`.`id` = `tweets`.`user_id`
ORDER BY `created_at` DESC
---
    public function getLatest()
    {
        $query = $this->select('tweets.id, user_id, username, fullname, content, category, created_at, uphoto, tweets.like')
            ->orderBy('created_at', 'desc')
            ->join('users', 'users.id = tweets.user_id');
        return $query->findAll();