app/Models/UserModel.php

INSERT INTO `users` (`username`, `password`, `fullname`) VALUES ('orangasing', '$2y$10$THDeFEkawLOkIF3MmRtMveAflNMNQTlwqHEHx8AJI3SfCsWvetRjy', 'orangsawah')
---
    public function addUser($data)
    {
        $user = new \App\Entities\User();
        $user->username = $data['username'];
        $user->password = $data['password'];
        $user->fullname = $data['fullname'];
        $this->save($user);

SELECT *
FROM `users`
WHERE `username` = 'test23'
 LIMIT 1
---
    public function login($username, $password)
    {
        $user = $this->where('username', $username)->first();